{"pageProps":{"data":{"data":{"id":4,"title":"What Does It Mean To Be Inclusive?","content":"To be inclusive means to actively and intentionally create an environment, culture, or society where everyone feels valued, respected, and included, regardless of their differences. It involves embracing diversity and recognizing that each individual brings unique perspectives, backgrounds, experiences, and abilities to the table. Inclusion goes beyond mere tolerance and seeks to foster a sense of belonging and equal opportunity for all.\n\nBeing inclusive requires promoting equality and fairness, dismantling barriers, and addressing systemic biases and discrimination. It involves creating spaces where people from different races, ethnicities, genders, sexual orientations, religions, socioeconomic backgrounds, ages, disabilities, and other identities can participate, contribute, and thrive on an equal footing.\nInclusive practices involve actively listening to diverse voices, engaging in dialogue, and valuing different opinions and perspectives. It requires challenging stereotypes, prejudices, and biases that perpetuate exclusion and working towards creating a more equitable and just society. \n\nInclusion is not about assimilating others into the dominant culture but rather creating an environment that respects and celebrates diversity.\n\nUltimately, being inclusive means recognizing the inherent worth and dignity of all individuals and ensuring that everyone has equal access to opportunities, resources, and decision-making processes. It is about fostering a sense of community where everyone can fully participate, feel respected, and have their needs met.\n","author":"Kristi Ramirez, PMHNP-BC, FNP-C","description":"To be inclusive means to actively and intentionally create an environment, culture, or society where everyone feels valued, respected, and included, regardless of their differences.","date":"2023-04-03","category":"test","slug":"what-does-it-mean-to-be-inclusive","imgURL":null,"articleNumber":4,"createdAt":"2023-06-19T11:24:46.130Z","updatedAt":"2023-06-20T10:00:20.863Z","publishedAt":"2023-06-19T11:29:23.865Z","image":{"id":2,"name":"blog-1960x600.png","alternativeText":null,"caption":null,"width":960,"height":600,"formats":{"small":{"ext":".png","url":"/uploads/small_blog_1960x600_4ae781c3ff.png","hash":"small_blog_1960x600_4ae781c3ff","mime":"image/png","name":"small_blog-1960x600.png","path":null,"size":404.22,"width":500,"height":313},"medium":{"ext":".png","url":"/uploads/medium_blog_1960x600_4ae781c3ff.png","hash":"medium_blog_1960x600_4ae781c3ff","mime":"image/png","name":"medium_blog-1960x600.png","path":null,"size":912.11,"width":750,"height":469},"thumbnail":{"ext":".png","url":"/uploads/thumbnail_blog_1960x600_4ae781c3ff.png","hash":"thumbnail_blog_1960x600_4ae781c3ff","mime":"image/png","name":"thumbnail_blog-1960x600.png","path":null,"size":96.43,"width":245,"height":153}},"hash":"blog_1960x600_4ae781c3ff","ext":".png","mime":"image/png","size":515.82,"url":"/uploads/blog_1960x600_4ae781c3ff.png","previewUrl":null,"provider":"local","provider_metadata":null,"createdAt":"2023-06-20T09:54:50.131Z","updatedAt":"2023-06-20T10:01:50.023Z"}},"meta":{}}},"__N_SSG":true}